{
  "我不仅看过《泰坦尼克号》，也看过《诺丁山》。": "I have not only seen Titanic, but also Notting Hill.",
  "不仅马克看过《诺丁山》，我也看过《诺丁山》。": "Not only did Mark see Notting Hill, I also saw Notting Hill.",
  "我中午从来不睡觉。": "I never sleep at noon.",
  "他爸爸妈妈从来没这么高兴过。": "His father and mother have never been so happy.",
  "我上个月刚结婚。": "I just got married last month.",
  "他刚来一个月。": "He’s been [lit. come] here for just a month.",
  "刚才我收到了一封电子邮件。": "I just received an email.",
  "即使冬天很冷，他也每天去操场跑步。": "Even if it’s very cold in winter, he still goes to the playground to job every day.",
  "在爱好上，我更像我妈妈。": "In terms of hobbies, I am more like my mother.",
  "衣服大小正好。": "The clothes are just the right size.",
  "你来得正好。": "You came at just the right time.",
  "这辆车的颜色和那辆车的颜色差不多。": "The color of this car is similar to the color of that car.",
  "这台电脑差不多5000块。": "This computer is about 5,000 yuan.",
  "女儿个子跟我差不多一样高。": "My daughter is about as tall as me.",
  "工作差不多干完了。": "Work is about finished.",
  "这台电脑几乎5000块。": "This computer is almost 5,000 yuan.",
  "得失几乎相当。": "The loss and the gain are almost the same.",
  "这件事我几乎忘了告诉你了。": "I almost forgot to tell you about this.",
  "尽管今天很冷，可是他穿的衣服很少。": "Although it is very cold today, he wears very little clothes.",
  "(虽然/尽管) 工作很忙，她们却每天坚持锻炼。": "(Although) they are busy at work, but they insist on exercising every day.",
  "听、说能力很重要，而写汉字的能力也重要。": "Listening and speaking abilities are very important, and (on the other hand) the ability to write Chinese characters is also important.",
  "我挺喜欢这个地方的。": "I quite like this place.",
  "她本来想学新闻，但是现在学习法律。": "She originally wanted to learn the news, but now she is studying law.",
  "学生本来就不应该上课迟到。": "Students should not be late for class in the first place.",
  "他拿出另/另外/另外的一本书。": "He took out another book.",
  "不要看这本书，请看另外的/其他的/别的书。": "Don't read this book, please read other books.",
  "他另/另外给了我三十元。": "He gave me another 30 yuan.",
  "多吃水果。另外，还要记得多喝水。": "Eat more fruits. Also, remember to drink more water.",
  "应聘时，首先要穿正式的衣服，其次不要紧张。": "At the job interview, first [you] should wear formal clothing, and second don't be nervous.",
  "不管什么电影，我都喜欢看。": "I like to watch all kinds of movies. (Lit. No matter what movie, I like to watch them all.)",
  "我以为东西是给我的，其实是给爸爸的。": "I thought the thing was for me, but actually it was for my father.",
  "原来/本来需要12个小时。": "It originally required 12 hours.",
  "我还以为是谁帮我打扫房间呢，原来是你啊！": "I was wondering who was cleaning the room for me. It turns out it’s you!",
  "大家说外面很冷，但我并不觉得冷。": "Everyone said that it was cold outside, but I (rather) didn’t feel cold.",
  "我们还是按照原来的计划进行。": "We are still proceeding according to the original plan.",
  "他工作很努力，甚至忘了吃饭。": "He worked hard and even forgot to eat.",
  "运动对身体健康肯定有好处。": "Exercise is definitely good for your health.",
  "我能肯定，张远一定会来。": "I can be sure that Zhang Yuan will definitely come.",
  "他的回答是肯定的。": "His answer is yes (in the affirmative).",
  "现在学习忙，考完再说吧。": "I’m busy studying now, let’s talk about it / deal with it (until) after the exam.",
  "毕业后大家都很忙，再说，很多同学不在一个城市。": "After graduation, everyone was very busy. Besides, many students are not in a city.",
  "实际的东西跟广告上的不一样。": "The actual thing is different from the one on the advertisement.",
  "广告跟实际不一样。": "Advertising is not the same as the actual [thing].",
  "广告说得好，实际上不一定好。": "The advertisement is well said, but it is not necessarily good in reality.",
  "对我来说，学习机会更重要。": "For me, learning opportunities are more important.",
  "您女儿长得特别像您。": "Your daughter looks especially like you.",
  "您女儿长得真像您，特别是/尤其眼睛。": "Your daughter looks like you, especially her eyes.",
  "我有一个特别的要求。": "I have a special request.",
  "这个歌特别好听，最近很流行，你竟然没听过？": "This song is particularly nice, it has been very popular recently, you’re telling me you’ve never heard of it?",
  "二的五倍是十。": "2, multiplied 5 times, is 10.",
  "您看看这个，不管从价格方面看， 还是从质量上看， 都是值得考虑的。": "Look at this, both in terms of price and quality, it is worth considering.",
  "别总是为一点儿小事生气，不值/值得。": "Don't always be angry with a little thing, it’s not worth it.",
  "这个手表值五十块。": "This watch is worth fifty yuan.",
  "我们不仅要会读书，还要会选择其中的好书来读。": "Not only do we have to read books, but we also need to know how to choose the good ones among them to read.",
  "(在) 一般情况下，你花的钱越多，买的东西也就越好。": "In general (lit. under general circumstances), the more money you spend, the better the goods you buy.",
  "你有没有去问问小王？估计/可能他应该有办法。": "Have you asked Xiao Wang? Perhaps he should have a solution.",
  "我还不习惯北方的气候，估计/可能是天气太干。": "I am not used to the climate in the north. Perhaps it’s because the weather is too dry.",
  "他这么多天没来上课，最可能的原因就是他回国了。": "He did not come to class for so many days. The most probable reason is that he returned to China.",
  "等你身体出现问题了，后悔就来不及了。": "When you have a problem with your health, it’ll be too late to regret it.",
  "咱们午饭后就去附近的公园散散步吧。": "Let's go for a walk in the nearby park after lunch.",
  "星期天我睡了睡觉，游了游泳，做了做作业。": "On Sunday, I slept a bit, did some swimming, [and] did some homework.",
  "要是质量好的话，那么价格贵一点儿也没关系。": "If the quality is good, then it doesn't matter if the price is a little bit expensive.",
  "散步既可以活动身体，又可以减肥。": "Walking can [allow you to] both move the body and lose weight.",
  "怎么样才能使她喜欢我呢？": "How can I make her like me?",
  "只要这次你好好儿准备，(就) 一定能把比赛踢好。": "As long as you are ready this time, you will be able to play the match well.",
  "A: 没想到咱们毕业都已经十年了。B: 可不是！时间过得太快了， 真想大家。": "A: I didn't expect that we have graduated for ten years.\nB: Tell me about it! Time flies too fast, I really miss everyone.",
  "我认识他很多年，因此，很了解他的性格。": "I have known him for many years, so I know his character very well.",
  "女孩子对衣服颜色的选择往往与她们的性格有关。": "Girls' choice of clothing color is often related to their personality.",
  "上大学时我很喜欢运动，经常/常打篮球、踢足球。": "When I was in college, I liked sports very much. I often played basketball and football.",
  "怎么又买了这么多饼干和巧克力？难道你不减肥了？": "How did you buy so many cookies and chocolates? Could it be that you’re not dieting any more?",
  "任何成功都要通过努力才能得到。": "Any success must be achieved through hard work.",
  "经过一次次失败之后，他终于成功了。": "Having gone through many failures, he finally succeeded.",
  "这条街只能步行通过。": "You can only go through this street on foot.",
  "我正好经过这儿，顺便过来看看你。": "It just so happened that I’m passing by, [so I] came to see you on the way.",
  "我通过那家公司的面试了。": "I passed the interview with that company.",
  "小王把事情的经过告诉我了。": "Xiao Wang told me the whole story of [how] the event [happened].",
  "当时她的父母和亲戚都不支持她，可是她坚持自己的选择。": "At that time her parents and relatives did not support her, but she insisted on her choice.",
  "请把调查结果交上来。": "Please submit the results of the investigation.",
  "上学期他学习很用功，结果考试及格了。": "He studied hard last term and, as a result, he passed the examination.",
  "这个城市的地铁已经有上百年的历史了。": "The city's subway has been around for over a hundred years.",
  "我本来想当律师，不过后来我发现自己对新闻更感兴趣。": "I originally wanted to be a lawyer, nevertheless I found myself more interested in news.",
  "我们不过谈了点儿工作方面的问题，别的都没谈。": "We only talked about some work problems (and nothing more), and we didn’t talk about anything else.",
  "爱情确实是结婚的重要原因，但仅有爱情是不够的。": "Love is indeed an important reason for marriage, but only love is not enough.",
  "在很多人看来，听流行音乐仅仅是年轻人的爱好。": "The way a lot of people sees it [is that] listening to pop music is only a hobby of young people.",
  "由于我们的共同努力，任务提前完成了。": "Owing to our joint efforts, the task was fulfilled ahead of schedule.",
  "由于种种原因，我们不得不改变原来的计划。": "For various reasons, we had to change the original plan.",
  "旅游前最好做个计划，比如要去几个地方，怎么坐车等。": "It is best to make a plan before the trip, for example, how many places to go to, how to take transit, etc.",
  "你太厉害了，连中文报纸都看得懂。": "You are so awesome/skilled you can even understand Chinese newspapers.",
  "如果连你自己都不喜欢自己，又怎么能让别人喜欢你呢？": "If even you don’t like yourself, how can you let others like you?",
  "他一定有重要的事找你，否则不会打这么多次电话来。": "He must have something important to see (lit. look for) you about, otherwise he won't call so many times.",
  "无论/不管做什么事都要注意方法，正确的方法可以让我们做得更好。": "Regardless of what you do, choose the right [lit. pay attention to] your methods. The right way can make us do better.",
  "很多人觉得自己的生活是幸福的， 然而每个人对幸福的看法却不完全相同。": "Many people feel that their lives are happy, but everyone's views on happiness are not exactly the same.",
  "阅读能丰富你的知识，同时还会丰富你的情感。": "Reading can enrich your knowledge and (at the same time) [it will] enrich your affects.",
  "在学习汉语的同时，我还了解了中国的文化。": "While learning Chinese (at the same time), I also learned about Chinese culture.",
  "他做事很认真，并且有丰富的经验，让他负责很合适。": "He is very serious in his work and has a wealth of experience, which makes him very suitable to be responsible [for this].",
  "事情已经发生了，你再后悔也无法改变，别伤心了。": "Things have already happened, no matter how you regret it you (still) won’t be able to change it, don't be sad.",
  "对于这件事， 我跟大家的看法不同。": "My opinion on it (lit. regarding this matter) is different from everyone else’s.",
  "关于这次调查计划，经理说有很多不清楚的地方。": "About the survey plan, the manager said that there are many unclear places.",
  "件件小事都应该被看成是一次学习的机会。": "Each small thing should (all) be seen as an opportunity to learn.",
  "使用正确的方法就能“事半功倍”，相反就会“事倍功半”。": "Using the right method will be able to “do more with less”, but if we do the opposite we will “do less with more”.",
  "调查结果和他们想的几乎完全相反。": "The results of the survey are almost completely the opposite of what they thought.",
  "我想校长大概/也许会同意。": "I think the principal probably will agree.",
  "请给我一个大概的数字。": "Please give me an approximate number.",
  "他8岁就开始上台演出，到现在大概唱了60多年了。": "He started performing on stage at the age of eight, and has been singing for about over 60 years.",
  "我常常跟着电视学唱京剧，偶尔跟中国人一起唱上几句。": "I often learn to sing Beijing opera with [lit. by following] TV programs, and occasionally sing a few lines with Chinese people.",
  "按照规定，这件事情应该由王大夫负责。": "According to regulations, this matter should be handled by Dr. Wang.",
  "10点30分会议继续进行。": "The meeting will continue to proceed at half past 10.",
  "进行观察": "carry out an observation",
  "随着社会的发展，京剧也在改变。": "With the development of society, Peking Opera is also changing.",
  "钱不够。": "The money is not enough.",
  "睡觉时间太长并不好，一般睡够八小时就可以了。": "It’s not good if [your] sleeping time is too long. Usually it’s enough just to sleep for a good eight hours (lit. sleep to fulfill 8 hours).",
  "不用装这些，箱子已经够重的了！": "No need to load these, the box is already heavy enough!",
  "经理您放心，我一定以最快的速度完成。": "Manager, you can rest assured that I will finish at the fastest speed.",
  "我们应该以历史为镜子。": "We should use history as a mirror.",
  "她送来了一份礼物以表示感谢。": "She sent a gift to express her gratitude.",
  "你既然不愿意打球，为什么还要打？": "Since you don't want to play, why [bother] playing?",
  "小时候，他经常生病，于是每天都去跑步锻炼身体。": "When he was a child, he was often ill, consequently he went to run and exercise every day.",
  "小时候，他经常生病，因此每天都去跑步锻炼身体。": "When he was a child, he was often ill, [and] as a result he went to run and exercise every day.",
  "明天出去玩儿，得买点儿饼干、面包什么的。": "Go out to play tomorrow, you have to buy some biscuits, bread or things like that.",
  "你这样躺着看书对眼晴不好，快坐起来！": "If you lie down and read a book, it is not good for your eyes. Sit up quick!",
  "现在我全都想起来了。": "Now I recall (lit. think up) everything.",
  "搬的时候要小心点儿，别弄坏沙发了。": "Be careful when moving, don't break the sofa.",
  "每天因为这些小事批评她，弄得我俩心情都不好。": "Every day I tell her off for these small things, [which] makes the two of us both in a bad mood.",
  "我要等她生日那天再送给她这个礼物，你现在千万别告诉她。": "I have to give her this gift on her birthday, make sure you don’t tell her now.",
  "比赛前一定要把动作练好。": "You must practice your moves before the game.",
  "感谢您的支持和鼓励，我一定会继续努力。": "Thank you for your support and encouragement, I will definitely continue to work hard.",
  "个子高不一定力气大。": "If someone is tall he/she is not necessarily strong.",
  "如果有一定的语言基础，那么出国学习外语是最好的选择。": "If you have a certain language foundation, then studying a foreign language abroad is the best choice.",
  "这个沙发这么大，我来帮你们一起抬。": "This sofa is so big, I will help you carry it together.",
  "有的孩子会通过哭或者扔东西来引起父母的注意。": "Some children will get their parents' attention by crying or throwing things.",
  "网上买的那本书估计三天左右就能到。": "The book bought online is estimated to be available in about three days.",
  "今天天气可热了。": "The weather is really hot today.",
  "下个星期就要去使馆办签证了，这可怎么办？": "I am going to the embassy to apply for a visa next week, what on earth am I supposed to do?",
  "这可是个大问题，我也不太清楚。": "Now this (this indeed) is a big question, and I am not too sure about it.",
  "我的工作经验还比较少，那份工作我怕/害怕完成不了。": "My work experience is still relatively small, I am afraid the job cannot be completed.",
  "听完我的回答，恐怕你已经知道我的答案了吧。": "After listening to my response, I guess I’m afraid you already know the answer.",
  "他离开这里怕/恐怕有二十天了。": "He left here for probably 20 days (I’m afraid).",
  "今天我一定陪你逛街逛到底，保证让你买到合适的衣服。": "Today I will go shopping with you to the end. [I can] guarantee that you will buy the right clothes.",
  "到底你怎么打算的呀？": "What in the world are you planning?",
  "拿我来说，我已经学了十年汉语了。": "Take me, for example, I’ve been learning Chinese for 10 years.",
  "谁也不敢说他的坏话。": "No one dares to say bad things about her.",
  "我给你倒杯水吧。": "I will pour you a glass of water.",
  "“我爱你”，倒过来就是“你爱我”。": "“I love you” said in reverse is “you love me.”",
  "你说得倒是容易，做起来可就难了！": "Although you say [it as if] it is easy, it’s hard to do it!",
  "把头发擦干。": "Wipe your hair dry.",
  "你在干什么呢？": "What are you doing?",
  "回来的路上我顺便去了趟银行。": "On the way back, I made a visit to the bank along the way.",
  "502次公交车很快就要到了。": "Bus No. 502 are coming soon.",
  "不少动物为了保护自己而改变身体的颜色。": "Many animals change the color of their body in order to protect themselves.",
  "植物会为了阳光、空气和水而竞争。": "Plants compete for sunlight, air, and water.",
  "就算在几公里深的海底也仍然能看到东西。": "Even at a few kilometers deep on the sea floor, you can still see things.",
  "不过她这么小，这本书我不知道她是否能读懂。": "But she is so young, I don't know if she can read this book.",
  "我真的受不了你了，你到底还要逛多久？": "I really can't tolerate you, how long do you have to keep shopping?",
  "你看完这本书以后先不要还，我接着看。": "Don't pay back after reading this book, I will continue to watch.",
  "他毕业后在老家工作了一年，接着又考上了北京大学，读研究生。": "After graduating, he worked in his hometown for a year. And then he was admitted to Peking University to study for graduate students.",
  "他和弟弟同一天出生，兄弟俩长得很像，但除此以外几乎再找不到其他共同点。": "He and his brother were born on the same day. The two brothers look very much alike, but other than that they can hardly find other things in common.",
  "中国人把黄河叫作“母亲河” 。": "The Chinese call the Yellow River \"Mother River.",
  "没关系，不用道歉，(无论/不管) 谁都有粗心填错的时候。": "It doesn't matter, don't apologize, anyone (lit. no matter who) can make a mistake.",
  "看来今天吃不上羊肉饺子了。": "It seems that I don’t get to eat lamb dumplings today.",
  "有几个选择题，实在想不出来该选哪个，只好随便选一个。": "There were a few multiple-choice questions. I really couldn’t think of (lit. think out) which [answer] one to choose, [so I could only] choose one at random.",
  "这个公司总的来说还不错。": "Overall, this company is good.",
  "人们常说“生命在于运动”。": "People often say that \"life is all about moving/exercising.”",
  "她讲着讲着就笑了。": "As she was speaking, she started to laugh.",
  "她一回家就看电视。": "As soon as she gets home, (then) she watches TV.",
  "儿子小时候一说话就脸红。": "When [my] son was a child, as soon as he speaks, (then) he blushes.",
  "究竟哪个季节去旅游比较好呢？": "Which season exactly is better to travel?",
  "你先把桌子上的东西拿起(来)，我擦完之后你再放下来。": "You pick up the things on the table first, and then you [can] put them down after I clean it.",
  "小王又唱起来了。": "Xiao Wang started singing again.",
  "上海话听起来就像外语一样。": "The Shanghai dialect sounds like a foreign language.",
  "说起吃的东西，给我印象最深的是湖南菜。": "Speaking of food, the one that impressed me the most is Hunan cuisine."
}
