{
  "评委叫第一对夫妻说说他俩是如何恩爱的。": "The judge called the first couple to talk about how they loved each other.",
  "“80后”们月收入情况如何？": "How is the monthly income situation with those born in the 80s?",
  "怎么，你不认识我了？！": "What, you don't know me anymore?!",
  "王老师喜欢靠着桌子讲课。": "Teacher Wang likes to give her lecture while leaning on the table.",
  "我的座位是17号，是靠窗的座位。": "My seat is No. 17, which is (a seat) by the window.",
  "在家靠父母，出门靠朋友。": "At home [you] relies on [your] parents, [when you] go out [you] rely on [your] friends.",
  "这么简单的题，你居然也不会做？": "[For] such a simple question, [you’re telling me that] you don’t know how to do it?",
  "改革开放以来，中国发生了巨大的变化。": "Since the reform and opening up, China has undergone tremendous changes.",
  "我想买一套不临街的房子，这样不会太吵。": "I want to buy a house that is not adjacent to a street, so it won't be too noisy.",
  "临走那天，父亲从老家赶来送我们。": "On the day (just before) he left, my father came to us from my hometown.",
  "我们回来时，立刻感受到了家的温暖。": "When we came back, we immediately felt the warmth of home.",
  "汉语技能教学包括听、说、读、写四个方面。": "Chinese language skills teaching includes listening, speaking, reading and writing.",
  "中场休息时间到了，比赛双方队员各自回场外休息。": "The intermission time has arrived, and the players on both sides of the game (each by themselves) went back out of the court to rest.",
  "非工作人员，请勿入内。": "If you’re not a staff member, please do not enter.",
  "在最后时刻，他为本队踢进了关键一球。": "At the last moment, he scored the key goal for the team.",
  "工作中，他时时刻刻提醒自已： 乘客的安全是最重要的。": "At work, he reminds himself at all times: The safety of passengers is the most important.",
  "我在北京出生、长大，至今还没离开过呢。": "I was born and raised in Beijing and have never left to this day.",
  "我这顶新帽子怎么样？": "How [what do you think of] this new hat of mine?",
  "请把手举过头顶。": "Please raise your hand over (the top of) your head.",
  "他能用头顶起20斤重的东西。": "He can use his head to lift 20 pounds.",
  "天气非常寒冷，子路顶着大雪往前走。": "The weather is very cold, and Zilu was trudging ahead against heavy snow.",
  "这个地方这么热闹，孩子们高兴得很/得不行/得不得了。": "The place is so lively, the children are very/so/extremely happy.",
  "大城市的生活虽然很精彩，但一辈子生活在农村的父母反而会不适应。": "Although the life in a big city is very exciting, [my] parents who have lived in rural areas for a lifetime will actually (opposite to what one expects) find themselves ill-adapted.",
  "比赛前做好思想准备可以减少运动员的压力，从而取得比赛的成功。": "Preparing mentally before the game can reduce the stress on the athletes [and] consequently achieve the success of the game.",
  "这家公司成立于1997年。": "This company was founded in 1997.",
  "李明没办法，只好求助于当经理的老同学王峰。": "Li Ming had no choice but to turn to Wang Feng (for help), the old classmate of the manager.",
  "他出身于知识分子家庭。": "He came from an intellectual family.",
  "运动有助于健康。": "Exercise is beneficial to health.",
  "水生动物不同于陆地动物。": "Aquatic creatures are different from terrestrial ones.",
  "压力也可以变为动力。": "Stress can also be turned into strength.",
  "在他看来，没有工作的生活就不能称其为生活。": "In his view, life without work cannot be called (as) life.",
  "地下水积蓄起来，越积越多。": "The groundwater is store (up) and accumulates.",
  "刘丽知道自己做得不对，躲起来不敢见我。": "Liu Li knows that she is doing something wrong, and she hides [herself] away and does not dare to see me.",
  "见了外公，请替我向他问好。": "When you see my grandfather, please say hello to him (on my behalf).",
  "李阳要去留学了，我们都替他高兴。": "Li Yang is going to study abroad, and we are all happy for him.",
  "这事儿经理已经同意了，只是出发的时间还说不定。": "The manager has already agreed, but the time of departure is still uncertain.",
  "别随随便便就说放弃，说不定下次就成功了。": "Don't just give up so easily, maybe you will succeed next time.",
  "我不敢相信这是真的，好像做梦似的。": "I can't believe this is true, it seems like a dream.",
  "他背着重重的电脑包挤地铁，下班回到家累得什么似的。": "He squeezed into the [crowded] subway with [his] heavy computer bag, and he was so tired when he got home from work.",
  "要下雨了， 路上的人纷纷往家里跑。": "It’s going to rain, and people on the road are running home (one after another in quick succession).",
  "一天， 他让士兵们去找一头大象和一些出生时眼晴就瞎了的人回来。": "One day, he asked the soldiers to find an elephant and some people who were blind when they were born.",
  "他会想办法的，你就别替他瞎担心了。": "He will find a way, you don't (thoughtlessly) worry about him.",
  "分别是暂时的，我们以后一定会再见。": "The separation is temporary. We will definitely see each other again in the future.",
  "我不知道这两种做法有什么分别。": "I don't know the difference between the two approaches.",
  "我分别找两个人打听了这件事，他们的说法都是一样的。": "I asked two people (separately) to ask about this, and they all said the same thing.",
  "砂岩和砾岩分别是砂和砾石固结的产物。": "Sandstone and conglomerate are the consolidated equivalent of sand and gravel, respectively.",
  "摸到尾巴的盲人说大象像一根绳子。": "The blind man who touched the tail said that the elephant is like a rope.",
  "这棵树的根又粗又长。": "The root of this tree is thick and long.",
  "楼上新买了一架钢琴，我们家便多了一些不安静。": "A new piano was bought upstairs, and then there were more noise (lit. unquiet) [heard] in our home.",
  "少年不解地问：“怎么勇敢反倒成为缺点了？”": "Puzzled, the teenager asked: \"How is it that bravery is a fault now (which is contrary to logic)?”",
  "质量倒是挺好，就是价格太贵了。": "(Despite all) the quality is (actually) pretty good, it’s just that the price is too expensive.",
  "你倒是说说看，这件事你不负责谁负责？": "Now you tell us, for crying out loud, if you’re not responsible for this, then who is?",
  "小狗追着自己的尾巴， 在草地上跑来跑去。": "The dog chased his tail and ran around on the grass.",
  "还好碰见你了，要不/不然/要不然我今天肯定要迟到了。": "Fortunately, I ran into you, otherwise I must have been late today.",
  "今天太晚了，要不/不然/要不然你明天再走吧。": "It’s too late today, why don’t (you) leave tomorrow instead?",
  "好朋友应该彼此帮助。": "Good friends should help each other.",
  "我们彼此的爱好相同。": "We (us two) have the same hobbies.",
  "咱们俩彼此彼此， 我画得比你好不了多少。": "We (the two of us) are pretty much the same, I can't paint much better than you.",
  "这钱就算我借给你的，将来你有了的时候再还我。": "Let’s just say that the money is loaned to you, you can pay me back when you have [more money].",
  "不就是一个空瓶子吗？扔掉算了。": "Isn't it just an empty bottle? Might as well throw it away.",
  "作为大作家、大学问家，鲁迅对吃很讲究。": "As a great writer and a great intellectual, Lu Xun is very particular about eating.",
  "孔子曾经带着学生周游各国14年，传播他的思想。": "Confucius once took students around the country for 14 years, spreading his thoughts.",
  "虽然我们遇到了很多困难，但毕竟完成了任务。": "Although we have encountered a lot of difficulties, we have completed the task after all.",
  "食物越来越少，老人不得不逐渐限制猴子的食量。": "With less and less food, the elderly have to gradually limit the amount of food they eat.",
  "虽然以前她不支持你，但或许这次会有变化。": "Although she did not support you before, maybe this time things will change.",
  "过了半天，脑子才清醒过来。": "My head cleared up only after a long time,",
  "天上的星星那么多，谁数得过来呀？": "There are so many stars in the sky, who can count them (out)?",
  "他来自北京的一所大学。": "He is from a university in Beijing.",
  "山水画(所)表现的是人与自然的关系。": "What the landscape painting shows is the relationship between man and nature.",
  "随着年龄的增大，女性的职场幸福感有所提高。": "As [their] age increases, women’s happiness at work has increased.",
  "你要是坚持真理就可以无所畏惧。": "If you stick to the truth, you've nothing to fear.",
  "开车打电话的人的反应速度与醉酒者相当。": "The reaction speed of the person who calls while driving is equivalent to a drunk.",
  "这种鸟一天所食的害虫相当于自己的体重。": "The pests that this bird eats a day are equivalent to its own weight.",
  "菜的味道好极了，服务也周到，我相当满意。": "The dish is very delicious, the service is also thoughtful, I am quite satisfied.",
  "相当一部分人会以收入多少作为幸福的标准。": "A considerable number of people will regard their income as a standard of happiness.",
  "我大概数了一下，车上有32个学生。": "I roughly counted it, there are 32 students in the vehicle.",
  "要说我们班跑得最快的，那就数李阳了。": "If we were to discuss who our class runs the fastest, then it’s no other than Li Yang.",
  "这里夏季的雷阵雨一般可持续数小时或者更久的时间。": "The thunderstorms in summer here generally last for several hours or longer.",
  "学校的领导、教师以及一些学生代表观看了演出。": "School leaders, teachers, and some student representatives watched the show.",
  "问题已经发展到了十分严重的程度。": "The problem has grown to a very serious degree.",
  "连运动员都不满意，更何况看比赛的球迷呢？": "Even the athletes are not satisfied, let alone the fans watching the game?",
  "你何必亲自送一趟呢？叫个快递不就行了？": "Why do you have to deliver it yourself? Calling a courier is not enough?",
  "多亏了他这句话，人们如梦初醒。": "Thanks to his words, people wake up like a dream.",
  "他所谓的“新闻”， 其实我们早就知道了！": "His so-called \"news\", in fact, we already know!",
  "他高中毕业以后出国留学了，而我则一直留在国内。": "After graduating from high school, he went abroad to study, whereas I stayed at home.",
  "北京的冬天，有风则寒，无风则暖。": "Beijing in the winter, if it’s windy then it’s cold, and if not then it’s warm.",
  "今天的报纸上有一则非常重要的新闻。": "There is a very important news in today's newspaper.",
  "有了科学，大自然就可以更好地为人所用。": "With science, nature can be better used by mankind.",
  "拉起手，我们就是好朋友。": "Joining (lit. grab/pull up) our hands, we are good friends.",
  "跟别人谈论起军事来，没有人说得过他。": "Talking to others about military affairs, no one can win arguments (lit. talk) over him.",
  "随着网络技术的发展，这些问题迟早都会得到解决。": "With the development of network technology, these problems will be solved sooner or later.",
  "赵括的母亲再三阻止赵王任命儿子为大将。": "Zhao Kuo’s mother repeatedly prevented Zhao Wang from appointing his son as a general.",
  "“旦”是象形字，即太阳从地平线上升起。": "“旦” is a pictograph, that is, the sun rising from the horizon.",
  "不懂即问是他最大的优点，也是他成功的主要原因。": "If he doesn’t understand something, (then) he’ll just ask. This is his greatest strength, but also the main reason for his success.",
  "他经常采取个别谈话的方式了解情况和解决问题。": "He often uses individual conversations to understand the situation and solve problems.",
  "除了个别人以外，多数人体重的增加会从周六开始。": "Except for a few individual [persons], the weight gain of most people starts on Saturday.",
  "他非要离婚，我们谁拦也拦不住。": "He insists on divorcing, and we can’t stop it.",
  "出现非正常情况时请不要紧张。": "Please do not be nervous when emergencies (lit. abnormal conditions) occur.",
  "成功有时候并非想象中那么难。": "Success is sometimes not as difficult as it might seem.",
  "-": "-",
  "对小王来说，今天是一个不平常的日子。": "For Xiao Wang, today is an extraordinary day.",
  "他平常总是来得很早，今天却迟到了。": "He usually comes very early, but he is late today.",
  "作为母亲，她宁可自已累一点儿，也不想委屈了孩子。": "As a mother, she would rather be tired of herself and would not want to wrong her child.",
  "在中国，餐桌上放一把刀是极其少见的现象。": "In China, putting a knife on the table is an extremely rare phenomenon.",
  "怎么只有你们两个人？其余的同学呢？": "How come you two people? What about the rest of the classmates?",
  "由此可见，成功是需要努力的。": "This shows that success requires hard work.",
  "她的脸上露出了阳光般的笑容。": "Her face showed a sunny (lit. like sunlight) smile.",
  "他把壶盖儿打开，闻了闻，原来是酒。": "He opened the lid of the pot and smelled it. It turned out to be alcohol.",
  "百闻不如一见。": "Seeing is believing. (Lit. hearing about something 100 times is not as good as seeing it once.)",
  "趁电影还没开始，我去买两瓶矿泉水。": "The movie hasn’t started, I’ll make use of the opportunity and get two bottles of mineral water.",
  "他家里很穷，买不起灯，一到晚上就不能读书。": "His family is very poor and can't afford a lamp, [so he] can’t read at night.",
  "经得起时间考验的朋友才算是真正的朋友。": "A friend who can stand the test of time is a true friend.",
  "他的两只手放在桌上，支着脑袋，想着事情。": "His two hands were on the table, propping up his head, and he thought about things.",
  "给他十支枪，他就能拉起一支军队来。": "Give him ten guns and he can raise an army.",
  "干工作不能光凭经验，还要有创新。": "When we work, we can’t just rely on experience, we also need to innovate.",
  "虽然中药有点儿苦，但他还是硬喝下去了。": "Although the Chinese medicine is a bit bitter, he still bit the bullet and drank it.",
  "我不让他去，他硬要去。": "I won’t let him go, he just insists on going.",
  "那是一次偶然的相遇。": "It was an accidental encounter.",
  "她专心地织着毛衣，偶然也会抬眼看一下墙上的挂钟。": "She focused on knitting a sweater, and occasionally glances at the clock on the wall.",
  "新产品出了点儿问题，你和严经理尽快商量一下这事。": "The new product has some problems. You should discuss with Manager Yan as soon as you can.",
  "女人一旦做了母亲，就变得矛盾了。": "Once a woman becomes a mother, she becomes torn (by conflicting [emotions])",
  "刚开始工作，这样的错误是难免的。": "At the beginning of work, such mistakes are inevitable.",
  "自从我到北京以后，身体越来越好了。": "Since I arrived in Beijing, my body has gotten better and better.",
  "他们的意见不一致。": "Their opinions do not agree.",
  "专家们一致认为这是一种成功的产品。": "Experts agree (lit. unanimously think) that this is a successful product.",
  "进行某(个)方面的训练，就可以在那方面的能力提高。": "If you receiving training in a certain discipline (lit. aspect), you will be able to improve your ability in that discipline.",
  "在墙上写“某某到此一游”的行为是不文明的。": "It is not civil to write “so-and-so visited here” on the wall.",
  "公司业务员李某/李某某闻之大喜。": "Company salesman Li (So-and-so) heard the big joy.",
  "幸亏你提醒了我，我今天就去报名。": "Thankfully you reminded me. I am going to sign up today.",
  "我们应该勇敢面对困难，迅速采取行动。": "We should meet difficulties with courage and act quickly.",
  "他运动时受伤了，行动不便。": "When he was doing sports he injured his feet, so it’s hard for him to move around.",
  "有些鸟类喜欢单独行动。": "Some birds like to act alone.",
  "建设家乡，人人有责，我们也要承担这个义务。": "Everyone has the responsibility of building his/her hometown, and we should also take up this obligation.",
  "我们每个学期都要至少参加三次义务劳动。": "We must participate in at least three compulsory labor per semester.",
  "我仿佛看到胜利正朝我们走来。": "I seem to see victory coming towards us.",
  "我们学校的正门坐西朝东。": "The main entrance of our school is situated in the west and oriented toward the east.",
  "船长简直是疯了！": "The captain is practically mad!",
  "他几乎每天都能钓到5斤来重的大鱼。": "He can catch over 5 pounds (weight) of fish almost every day.",
  "我到这里看看大家，一(来)是给大家送水果，二(来)是看看大家过节还有什么难处。": "I am here to see everyone, one [reason] is to bring fruit to everyone, another [reason] is to see if anyone has any difficulties over the holidays.",
  "我们决定明年结婚，至于具体时间还要再商量。": "We decided to get married next year. As for the specific time, we’ll have to discuss later.",
  "他不至于撒谎。": "He won’t go so far as to tell a lie.",
  "经过沟通，大导演总算搞明白了。": "After communicating, the principal director has finally figured it out.",
  "虽然这家宾馆不太好，但总算有个睡觉的地方了。": "Although this hotel is not very good, there is finally a place to sleep.",
  "你的论文大概什么时候发表？定下来了吗？": "When will your paper be published? Have you decided (lit. decided down)?",
  "把你最喜欢的玩具送给小朋友，你舍得吗？": "Give your favorite toys to children, are you willing (to let go)?",
  "有些人舍不得把钱花在有意思的事情上。": "Some people are reluctant to spend money on fun things.",
  "从此李白刻苦用功，最后成了一位伟大的诗人。": "Since then, Li Bai has worked hard and finally became a great poet.",
  "假设你的钱用完了呢？你该怎么办呢？": "Suppose your money is running out? What would you do?",
  "您当年的假设已经被证明是对的。": "Your assumptions for the year have been proven to be correct.",
  "工厂旁边有一个建筑材料堆。": "There is a pile of building materials next to the factory.",
  "这些零件怎么都堆在这儿啊？": "How are these parts piled up here?",
  "三家的营业额加起来还不如他一家高。": "The turnover of the three companies is not as high as his family.",
  "与其待在家里，不如去外边走走。": "Instead of staying at home, it is better to go outside.",
  "许多亲朋好友建议他干脆把另三家书店挤垮。": "Many relatives and friends suggested that he simply “squeeze out” the other three bookstores, [quick and dirty]. [That its, drive them out of their business.]",
  "我求他帮忙，他答应得很干脆。": "I asked him for help, and he readily agreed.",
  "如果鸡蛋都放在一个篮子里，万一不小心就有可能全部打碎。": "If all [your] eggs are placed in one basket, should an accident happen they would all be crushed.",
  "不怕一万，就怕万一。": "We’re not afraid of the usual, just the unexpected mishap.",
  "她在收拾花园时，无意中/无意地找到了这只耳环。": "When she was cleaning up the garden, she accidentally found this earring.",
  "他无意伤害任何人。": "He has no intention to hurt anyone.",
  "适度的压力有利于我们保持良好的状态。": "Moderate pressure helps us stay in good shape.",
  "他的确是我所教过的学生中最聪明的。": "He is indeed the smartest of the students I have taught.",
  "A：吃了吗？B：嗯，吃了。": "A: Have you eaten? B: Yep, I did.",
  "嗯？难道是我记错了？": "Hmm… Is it that I remember correctly?",
  "嗯！你怎么还没走啊？": "(Man…) Why haven't you left yet?",
  "他学什么都可以很轻易地记住。": "What he can learn can be easily remembered.",
  "他从不轻易决定，决定了就不轻易转变。": "He never decided easily, and he decided not to change easily.",
  "污染和我们的日常生活密切相关。": "Pollution is closely related to our daily lives.",
  "从此，两人来往比先前密切了。": "Since then, the two have been closer than [ever] before.",
  "这条铁路大大密切了西南地区与首都的联系。": "This railway has greatly strengthened the connection between the southwest and the capital.",
  "尽量多骑自行车，多选择公共交通。": "Try to cycle as much as possible, and choose [to use] public transportation as much as possible.",
  "调整能源消费结构，逐步向可再生能源转变。": "Adjust energy consumption structure and gradually shift to renewable energy.",
  "虽然战争临近，但这里的日常生活，一切照常。": "Although the war is approaching, everyday life here is as usual.",
  "你的抽屉真乱，难怪/怪不得总是找不到东西。": "Your drawer is really messy, no wonder you can never find [your] things.",
  "他从来不操心孩子的事。这也难怪/怪不得，他那么忙，哪儿有时间啊。": "He never concerns [himself] with his children’s problems (lit. matters). But that’s no surprise. He’s so busy, how could he find the time?",
  "与其堵在路上，倒不如改乘公交出行。": "Instead of being stuck on the road, it would be better to use public transit instead.",
  "我想去上海、南京，杭州……总之想去南方转转。": "I want to go to Shanghai, Nanjing, Hangzhou... In short, I want to go south.",
  "他转过身，一句话也不说。": "He turned (his body) away, and didn’t say a word.",
  "短短的几分钟里，我的脑子里闪过了很多想法。": "In as little as a few minutes, many thoughts flashed by my mind.",
  "猴子突然站了起来，张开手臂抱住了管理员。": "The monkey suddenly stood up and opened his arm and hugged the zookeeper.",
  "我下个月要搬家， 得赶快找房子。": "I have to move next month, I have to find housing quickly.",
  "天上飘着一片云。": "There is a cloud in the sky.",
  "同学们听了，发出一片热烈的欢呼声。": "The students listened and gave a (wave of) warm cheer.",
  "我发现自己根本读不懂考试题。": "I found myself unable to read the exam questions at all.",
  "教育是国家的根本。": "Education is the foundation of the country.",
  "事情已经根本解决了。": "Things have been completely (lit. from the root) solved.",
  "他根本就是在故意找我们的麻烦。": "He is simply trying to make trouble for us.",
  "除非再给我一个星期，否则我们无法完成任务。": "Unless you give me another week, (otherwise) we can't complete the task.",
  "(除非)你答应我的条件，我才告诉你。": "(Unless) you promise me, I won’t tell you.",
  "这种机器，除非李阳，没人修得好。": "This kind of machine, except Li Yang, no one can fix.",
  "父亲听说儿子卖了房子，气得(他)直发抖。": "The father heard that his son had sold the house. He was so angry that he kept on shivering.",
  "直到今天，我也不明白他当时为什么发那么大脾气。": "Until today, I don’t understand why he had such a bad temper at the time.",
  "不管你们谁去，反正我不会去。": "I don’t care if any of you go. I won’t go anyway.",
  "三点一四": 3.14,
  "五分之一": "1/5",
  "百分之九": "9 percent",
  "如果乙方同意，甲方可以可以提前把产品交给乙方。": "If Party B agrees, Party A may give the product to Party B in advance.",
  "汗水顺着他的脸往下流。": "The sweat flowed down (along) his face.",
  "鸟类能觉察得出地球自北向南磁极的磁力线。": "Birds can perceive the magnetic field lines from the earth’s north magnetic pole to the south magnetic pole.",
  "你把书带着。": "Bring your book.",
  "我把这事(给)忘了。": "I forgot about this matter.",
  "我的手机给小偷偷走了。": "My mobile phone was stolen by the thief.",
  "天气这么好，何不出去玩儿玩儿呢？": "The weather is so good, why not go out and play?",
  "我何尝不想买一所大房子呢？": "Why wouldn’t I want to buy a big house?",
  "你何至于生这么大的气呢？": "Why do you have to get so angry?",
  "我们喝了个痛快。": "We drank to [our] satisfaction.",
  "据说，他年轻时曾经一个人去过非洲大森林。": "It is said that at one time he went to the great forest in Africa when he was young.",
  "这条河河道很窄，因而容易发生水灾。": "The river is narrow and is therefore prone to flooding.",
  "你不想干也得干。": "You still have to do it even if you don’t want to.",
  "我再累也要把作业做完。": "No matter how tired I am, I need to finish my homework."
}
